awk-cheatsheet.org
#+title: AWK Cheat Sheet
#+author: Manos Vasilakis (advizor.gr)
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/style.css" />

* AWK CheatSheet

** Basic Syntax:
#+BEGIN_SRC sh
$ awk [-F sepstring] [-v assignemnt]... program [arguments]...
#+END_SRC


** AWK Options:
| Option       | Description                                                       |
|--------------+-------------------------------------------------------------------|
| -F fs        | Specifies a file separator for delineating data fields in a line. |
| -f file      | Specifies a filename to red the program from.                     |
| -v var=value | Defines variable and default value used in AWK program.           |
| -mf N        | Specifies maximum number of fields to process in date file.       |
| -mr N        | Specifies the maximum record size in data file.                   |
| -W keyword   | Specifies the compatibility mode of warning level in AWK.         |


** Basic Useful Examples:
1. Print The 1st Word from each line of a given file:
   #+BEGIN_SRC sh
$ awk '{print $1}' inputfile
   #+END_SRC
2. Same but this Field Separator Character Specified:
   #+BEGIN_SRC sh
$ awk -F: '{print $1}' /etc/passwd
   #+END_SRC
3. Replace 4th element of a data stream:
   #+BEGIN_SRC sh
$ echo "My name is John" | awk '{$4="Christine"; print $0}'
   #+END_SRC
4. Run AWK script saved in file:
   #+BEGIN_SRC sh
$ awk -F script.awk /etc/passwd
   #+END_SRC
5. Execute AWK command Before reading the input data stream:
   #+BEGIN_SRC sh
$ awk 'BEGIN {print "Print this as file header"}
 {print $0}' datafile.txt
   #+END_SRC
6. Execute AWK command Before & After AWK reads the input data stream:
   #+BEGIN_SRC sh
$ awk 'BEGIN {print "The Header Line"} {print $0}
 {END {print "End of File"}' datafile.txt
   #+END_SRC
7. Cool AWK Script for Report generation:
   #+BEGIN_SRC sh
$ awk 'BEGIN { print "The latest list of users and shells"
    print "UserID \t\t Shell"
    print "------ \t\t ------"
    FS=":" }
    { print $1 " \t\t " $7 }
    END { print "This includes the listing"
 } ' /etc/passwd
   #+END_SRC


** AWK BUILT-IN VARIABLES
*** AWK Data Field & Record Variables:
| Variable    | Description                                                                                |
|-------------+--------------------------------------------------------------------------------------------|
| FIELDWIDTHS | A space-separated list of numbers defining the exact width (in spaces) of each data field. |
| FS          | Input field separator character.                                                           |
| RS          | Input record separator character.                                                          |
| OFS         | Output field separator character.                                                          |
| ORS         | Output record separator character.                                                         |
*** Examples:
| N | Description                                                           | Command                                                            |
|---+-----------------------------------------------------------------------+--------------------------------------------------------------------|
| 1 | Replace commas with spaces, on given data stream and print out needed | $ awk 'BEGIN {FS=","} {print $1,$2,$3}' datafile.txt               |
| 2 | Replace commas with any character or set of chars and print needed:   | $ awk 'BEGIN {FS=","; OFS="<->"} {print $1,$2,$3}' datafile.txt    |
| 3 | Using FIELDWIDTHS instead of separator characters, to organise data   | $ awk 'BEGIN {FIELDWIDTHS="3 5 2 5"} {print $1,$2,$3,$4}' data.txt |
| 4 | Organise data spawned on multiple lines                               | $ awk 'BEGIN {FS="\n"; RS=""} {print $1, $4}' datafile.txt         |


