html/awk-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-21 Tue 23:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AWK Cheat Sheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Manos Vasilakis (advizor.gr)" />
<link rel="stylesheet" type="text/css" href="./css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">AWK Cheat Sheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1df1a81">1. AWK CheatSheet</a>
<ul>
<li><a href="#org79c4d91">1.1. Basic Syntax:</a></li>
<li><a href="#orgef68795">1.2. AWK Options:</a></li>
<li><a href="#org8f29403">1.3. Basic Useful Examples:</a></li>
<li><a href="#org313ceda">1.4. AWK BUILT-IN VARIABLES</a>
<ul>
<li><a href="#orgd9ee4c8">1.4.1. AWK Data Field &amp; Record Variables:</a></li>
<li><a href="#org90fe6be">1.4.2. Examples:</a></li>
<li><a href="#org0fdd973">1.4.3. More AWK Built-in Variables:</a></li>
<li><a href="#orgbd8e770">1.4.4. More Examples:</a></li>
</ul>
</li>
<li><a href="#org5ec516d">1.5. AWK USER-DEFINED VARIABLES</a></li>
<li><a href="#orgda20296">1.6. AWK example usages:</a></li>
<li><a href="#orgb9ae683">1.7. Some cool AWK Stuff:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1df1a81" class="outline-2">
<h2 id="org1df1a81"><span class="section-number-2">1</span> AWK CheatSheet</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org79c4d91" class="outline-3">
<h3 id="org79c4d91"><span class="section-number-3">1.1</span> Basic Syntax:</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">$ awk [-F sepstring] [-v assignemnt]... program [arguments]...
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef68795" class="outline-3">
<h3 id="orgef68795"><span class="section-number-3">1.2</span> AWK Options:</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">-F fs</td>
<td class="org-left">Specifies a file separator for delineating data fields in a line.</td>
</tr>

<tr>
<td class="org-left">-f file</td>
<td class="org-left">Specifies a filename to red the program from.</td>
</tr>

<tr>
<td class="org-left">-v var=value</td>
<td class="org-left">Defines variable and default value used in AWK program.</td>
</tr>

<tr>
<td class="org-left">-mf N</td>
<td class="org-left">Specifies maximum number of fields to process in date file.</td>
</tr>

<tr>
<td class="org-left">-mr N</td>
<td class="org-left">Specifies the maximum record size in data file.</td>
</tr>

<tr>
<td class="org-left">-W keyword</td>
<td class="org-left">Specifies the compatibility mode of warning level in AWK.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8f29403" class="outline-3">
<h3 id="org8f29403"><span class="section-number-3">1.3</span> Basic Useful Examples:</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><p>
Print The 1st Word from each line of a given file:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'{print $1}'</span> inputfile
</pre>
</div></li>
<li><p>
Same but this Field Separator Character Specified:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk -F: <span style="color: #8b2252;">'{print $1}'</span> /etc/passwd
</pre>
</div></li>
<li><p>
Replace 4th element of a data stream:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ echo <span style="color: #8b2252;">"My name is John"</span> | awk <span style="color: #8b2252;">'{$4="Christine"; print $0}'</span>
</pre>
</div></li>
<li><p>
Run AWK script saved in file:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk -F script.awk /etc/passwd
</pre>
</div></li>
<li><p>
Execute AWK command Before reading the input data stream:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {print "Print this as file header"}</span>
<span style="color: #8b2252;"> {print $0}'</span> datafile.txt
</pre>
</div></li>
<li><p>
Execute AWK command Before &amp; After AWK reads the input data stream:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {print "The Header Line"} {print $0}</span>
<span style="color: #8b2252;"> {END {print "End of File"}'</span> datafile.txt
</pre>
</div></li>
<li><p>
Cool AWK Script for Report generation:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN { print "The latest list of users and shells"</span>
<span style="color: #8b2252;">    print "UserID \t\t Shell"</span>
<span style="color: #8b2252;">    print "------ \t\t ------"</span>
<span style="color: #8b2252;">    FS=":" }</span>
<span style="color: #8b2252;">    { print $1 " \t\t " $7 }</span>
<span style="color: #8b2252;">    END { print "This includes the listing"</span>
<span style="color: #8b2252;"> } '</span> /etc/passwd
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org313ceda" class="outline-3">
<h3 id="org313ceda"><span class="section-number-3">1.4</span> AWK BUILT-IN VARIABLES</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgd9ee4c8" class="outline-4">
<h4 id="orgd9ee4c8"><span class="section-number-4">1.4.1</span> AWK Data Field &amp; Record Variables:</h4>
<div class="outline-text-4" id="text-1-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">FIELDWIDTHS</td>
<td class="org-left">A space-separated list of numbers defining the exact width (in spaces) of each data field.</td>
</tr>

<tr>
<td class="org-left">FS</td>
<td class="org-left">Input field separator character.</td>
</tr>

<tr>
<td class="org-left">RS</td>
<td class="org-left">Input record separator character.</td>
</tr>

<tr>
<td class="org-left">OFS</td>
<td class="org-left">Output field separator character.</td>
</tr>

<tr>
<td class="org-left">ORS</td>
<td class="org-left">Output record separator character.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org90fe6be" class="outline-4">
<h4 id="org90fe6be"><span class="section-number-4">1.4.2</span> Examples:</h4>
<div class="outline-text-4" id="text-1-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">N</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Replace commas with spaces, on given data stream and print out needed</td>
<td class="org-left">$ awk 'BEGIN {FS=","} {print $1,$2,$3}' datafile.txt</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Replace commas with any character or set of chars and print needed:</td>
<td class="org-left">$ awk 'BEGIN {FS=","; OFS="&lt;-&gt;"} {print $1,$2,$3}' datafile.txt</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Using FIELDWIDTHS instead of separator characters, to organise data</td>
<td class="org-left">$ awk 'BEGIN {FIELDWIDTHS="3 5 2 5"} {print $1,$2,$3,$4}' data.txt</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Organise data spawned on multiple lines</td>
<td class="org-left">$ awk 'BEGIN {FS="\n"; RS=""} {print $1, $4}' datafile.txt</td>
</tr>
</tbody>
</table>
</div>
</div>
