awk-cheatsheet.org
*** More AWK Built-in Variables:
| Variable   | Description                                                                             |
|------------+-----------------------------------------------------------------------------------------|
| ARGC       | The number of command line parameters present.                                          |
| ARGID      | The index in ARGV of the current file being processed.                                  |
| ARGV       | An array of command line paramenters.                                                   |
| CONVFMT    | The conversion formatfor numbers (see printf statement), with a default value of %.6 g. |
| ENVIRON    | An associative array of the current shell environment variables and their values.       |
| ERRNO      | The system error if an error occurs when reading or closing input files.                |
| FILENAME   | The filename of the data file used for input to AWK.                                    |
| FNR        | The current record number in the data file.                                             |
| INGORECASE | If set to a non 0 value, ignores case on characters.                                    |
| NF         | The total number of data fields in the data file.                                       |
| NR         | The numbers of input records processed.                                                 |
| OFMT       | The output format for displaying numbers, with a default of %.6 g                       |
| RLENGTH    | The length of the substring matched in the match function.                              |
| RSTART     | The start index of the substring matched in the match function.                         |
*** More Examples:
| N | Description                                                                                                   |
|---+---------------------------------------------------------------------------------------------------------------|
| A | Retrieve Shell Environment Variables ENVIRON                                                                  |
| B | Specify the last data field in the record without having to know its position                                 |
| C | The NFR contains the number of records processed in the current data file                                     |
| D | The NR contains the total number of records processed (put the same file (data1) as input twice to see diffs) |

| N | Command                                                                                                               |
|---+-----------------------------------------------------------------------------------------------------------------------|
| A | $ awk 'BEGIN {print ENVIRON["HOME"] print ENVIRON["PATH"]}'                                                           |
| B | $ awk 'BEGIN {FS=":"; OFS=":"} {print $1, $NF}' /etc/passwd                                                           |
| C | $ awk 'BEGIN {FS=","} {print $1, "FNR=" FNR} datafile.txt                                                             |
| D | $ awk 'BEGIN {FS=","} {print $1, "FNR=" FNR, "NR=" NR} END {print "There were", NR, "records processed"}' data1 data1 |



** AWK USER-DEFINED VARIABLES
1. Variables in AWK can have either numeric of character values:
   #+BEGIN_SRC sh
$ awk 'BEGIN { testing="This is a test"; print testing;
	testing=45; print testing }'
   #+END_SRC
2. The assignment statement can contain mathematical algorithms to handle numeric values:
   #+BEGIN_SRC sh
$ awk 'BEGIN {x=4; x=x*2+3; print x}'
   #+END_SRC
3. You can assign values to variables from the command line: (variables are set after AWK reads the data)
   #+BEGIN_SRC sh
$ cat script1.awk
	BEGIN {FS=","}
	{print $n}
   #+END_SRC
   #+BEGIN_SRC sh
	$ awk -f script1.awk n=2 datafile.txt
   #+END_SRC
4. Set variables before AWK reads the data (before the BEGIN
   section of the code with the -v parameter:
   #+BEGIN_SRC sh
$ cat script2.awk
	BEGIN {print "The starting value is:",n; FS=","}
	{print $n}
   #+END_SRC
   #+BEGIN_SRC sh
$ awk -f script2.awk n=3 datafie.txt
	The starting value is:
	file contents.....
	......[...]...
	SOLUTION:
   #+END_SRC
   #+BEGIN_SRC sh
$ awk -v n=3 -f script2.awk datafile.txt
	The starting value is: 3
	file contents....[...].
    #+END_SRC
5. Associative Arrays (like dictionaries):
   - Declaration Syntax:
     #+BEGIN_SRC <awk>
studentPhones["Nick"] = "210.9323567"
     #+END_SRC
   - Basic Examples:
     #+BEGIN_SRC sh
$ awk 'BEGIN {capital["Illinois"] = "Springfield";
	print capital["Illinois"]}'
    #+END_SRC
    #+BEGIN_SRC sh
$ awk 'BEGIN {var[1] = 34; var[2] = 3; total=var[1]+var[2];
	print total}'
    #+END_SRC
   - Iterate through array elements with a for loop:
     #+BEGIN_SRC sh
$ awk 'BEGIN {var["a"] = 1; var["g"] = 2; var["m"] = 3;
	var["u"] = 4;
	for (test in var) {
		print "Index:", test, " - Value:", var[test]}
	}'
     #+END_SRC
   - Delete Array Variables:

     The delete command removes the associative index value and the associated data element value from the array:
     #+BEGIN_SRC sh
$ awk 'BEGIN {var["a"] = 1; var["g"] = 2;
	> for (test iin var) {
	> print "Index:", test, " - Value:", var[test] }
	> delete var["g"]; print "---"
	> for (test in var)
	> print "Index:", test, " - Value:", var[test] }'
     #+END_SRC


