html/awk-cheatsheet.html

<div id="outline-container-org0fdd973" class="outline-4">
<h4 id="org0fdd973"><span class="section-number-4">1.4.3</span> More AWK Built-in Variables:</h4>
<div class="outline-text-4" id="text-1-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ARGC</td>
<td class="org-left">The number of command line parameters present.</td>
</tr>

<tr>
<td class="org-left">ARGID</td>
<td class="org-left">The index in ARGV of the current file being processed.</td>
</tr>

<tr>
<td class="org-left">ARGV</td>
<td class="org-left">An array of command line paramenters.</td>
</tr>

<tr>
<td class="org-left">CONVFMT</td>
<td class="org-left">The conversion formatfor numbers (see printf statement), with a default value of %.6 g.</td>
</tr>

<tr>
<td class="org-left">ENVIRON</td>
<td class="org-left">An associative array of the current shell environment variables and their values.</td>
</tr>

<tr>
<td class="org-left">ERRNO</td>
<td class="org-left">The system error if an error occurs when reading or closing input files.</td>
</tr>

<tr>
<td class="org-left">FILENAME</td>
<td class="org-left">The filename of the data file used for input to AWK.</td>
</tr>

<tr>
<td class="org-left">FNR</td>
<td class="org-left">The current record number in the data file.</td>
</tr>

<tr>
<td class="org-left">INGORECASE</td>
<td class="org-left">If set to a non 0 value, ignores case on characters.</td>
</tr>

<tr>
<td class="org-left">NF</td>
<td class="org-left">The total number of data fields in the data file.</td>
</tr>

<tr>
<td class="org-left">NR</td>
<td class="org-left">The numbers of input records processed.</td>
</tr>

<tr>
<td class="org-left">OFMT</td>
<td class="org-left">The output format for displaying numbers, with a default of %.6 g</td>
</tr>

<tr>
<td class="org-left">RLENGTH</td>
<td class="org-left">The length of the substring matched in the match function.</td>
</tr>

<tr>
<td class="org-left">RSTART</td>
<td class="org-left">The start index of the substring matched in the match function.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgbd8e770" class="outline-4">
<h4 id="orgbd8e770"><span class="section-number-4">1.4.4</span> More Examples:</h4>
<div class="outline-text-4" id="text-1-4-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">N</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">Retrieve Shell Environment Variables ENVIRON</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">Specify the last data field in the record without having to know its position</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">The NFR contains the number of records processed in the current data file</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">The NR contains the total number of records processed (put the same file (data1) as input twice to see diffs)</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">N</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">$ awk 'BEGIN {print ENVIRON["HOME"] print ENVIRON["PATH"]}'</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">$ awk 'BEGIN {FS=":"; OFS=":"} {print $1, $NF}' /etc/passwd</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">$ awk 'BEGIN {FS=","} {print $1, "FNR=" FNR} datafile.txt</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">$ awk 'BEGIN {FS=","} {print $1, "FNR=" FNR, "NR=" NR} END {print "There were", NR, "records processed"}' data1 data1</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org5ec516d" class="outline-3">
<h3 id="org5ec516d"><span class="section-number-3">1.5</span> AWK USER-DEFINED VARIABLES</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li><p>
Variables in AWK can have either numeric of character values:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN { testing="This is a test"; print testing;</span>
<span style="color: #8b2252;">        testing=45; print testing }'</span>
</pre>
</div></li>
<li><p>
The assignment statement can contain mathematical algorithms to handle numeric values:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {x=4; x=x*2+3; print x}'</span>
</pre>
</div></li>
<li><p>
You can assign values to variables from the command line: (variables are set after AWK reads the data)
</p>
<div class="org-src-container">
<pre class="src src-sh">$ cat script1.awk
        BEGIN {<span style="color: #a0522d;">FS</span>=<span style="color: #8b2252;">","</span>}
        {<span style="color: #483d8b;">print</span> $<span style="color: #a0522d;">n</span>}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh">$ awk -f script1.awk <span style="color: #a0522d;">n</span>=2 datafile.txt
</pre>
</div></li>
<li><p>
Set variables before AWK reads the data (before the BEGIN
section of the code with the -v parameter:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ cat script2.awk
        BEGIN {<span style="color: #483d8b;">print</span> <span style="color: #8b2252;">"The starting value is:"</span>,n; <span style="color: #a0522d;">FS</span>=<span style="color: #8b2252;">","</span>}
        {<span style="color: #483d8b;">print</span> $<span style="color: #a0522d;">n</span>}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh">$ awk -f script2.awk <span style="color: #a0522d;">n</span>=3 datafie.txt
        The starting value is:
        file contents.....
        ......[...]...
        SOLUTION:
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh">$ awk -v <span style="color: #a0522d;">n</span>=3 -f script2.awk datafile.txt
        The starting value is: 3
        file contents....[...].
</pre>
</div></li>
<li>Associative Arrays (like dictionaries):
<ul class="org-ul">
<li><p>
Declaration Syntax:
</p>
<div class="org-src-container">
<pre class="src src-awk">studentPhones[<span style="color: #8b2252;">"Nick"</span>] = <span style="color: #8b2252;">"210.9323567"</span>
</pre>
</div></li>
<li><p>
Basic Examples:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {capital["Illinois"] = "Springfield";</span>
<span style="color: #8b2252;">        print capital["Illinois"]}'</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {var[1] = 34; var[2] = 3; total=var[1]+var[2];</span>
<span style="color: #8b2252;">        print total}'</span>
</pre>
</div></li>
<li><p>
Iterate through array elements with a for loop:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {var["a"] = 1; var["g"] = 2; var["m"] = 3;</span>
<span style="color: #8b2252;">        var["u"] = 4;</span>
<span style="color: #8b2252;">        for (test in var) {</span>
<span style="color: #8b2252;">                print "Index:", test, " - Value:", var[test]}</span>
<span style="color: #8b2252;">        }'</span>
</pre>
</div></li>
<li><p>
Delete Array Variables:
</p>

<p>
The delete command removes the associative index value and the associated data element value from the array:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {var["a"] = 1; var["g"] = 2;</span>
<span style="color: #8b2252;">        &gt; for (test iin var) {</span>
<span style="color: #8b2252;">        &gt; print "Index:", test, " - Value:", var[test] }</span>
<span style="color: #8b2252;">        &gt; delete var["g"]; print "---"</span>
<span style="color: #8b2252;">        &gt; for (test in var)</span>
<span style="color: #8b2252;">        &gt; print "Index:", test, " - Value:", var[test] }'</span>
</pre>
</div></li>
</ul></li>
</ol>
</div>
</div>
