awk-cheatsheet.org
** AWK example usages:
- Print Text File:
  #+BEGIN_SRC sh
$ awk '{ print }' /etc/passwd # - or -
  #+END_SRC
  #+BEGIN_SRC sh
$ awk '{ print $0 }' /etc/passwd
  #+END_SRC

- Print Specified Field
  #+BEGIN_SRC sh
$ awk -F ':' '{ print $1 }' /etc/passwd #| sort
  #+END_SRC

- Pattern Matching:

  (Display all  lines from the Apache log if HTTP error code is 500,
  9th field log status error code for each https request:)
  #+BEGIN_SRC sh
$ awk '$9 == 500 { print $0}' /var/log/httpd/access.log
  #+END_SRC

- Comparison Operators: (like C's)
  - ==
  - !=
  - <
  - >
  - <=
  - >=
  - ?:

- Print lines containing: "tom","jerry" or "vivek":
  #+BEGIN_SRC sh
$ awk '/tom|jerry|vivek/' /etc/passwd
  #+END_SRC

- Print 1st Line from file:
  #+BEGIN_SRC sh
$ awk "NR==1{print;exit}" /etc/resolv.conf
$ awk "NR==$line{print;exit}" /etc/resolv.conf
  #+END_SRC

- Simple Arithmetic: Get the sum of numbers in a column:
  #+BEGIN_SRC sh
$ awk '{total += $1'} END {print total}' earnings.txt
  #+END_SRC

- Shell can't calc floats, but awk can:
  #+BEGIN_SRC sh
$ awk 'BEGIN {printf "%.3f\n", 2005.50 / 3}'
  #+END_SRC

- Multiple AWK Commands
  #+BEGIN_SRC sh
$ echo "Hello Tom" | awk '{$2="Adam"; print $0}'
  #+END_SRC

- AWK Pre-processing
  - Add Title/Header:
    #+BEGIN_SRC sh
$ awk 'BEGIN {print "The File Contents: "}{print $0}' myfile
    #+END_SRC

- AWK Post-processing
  - Run Script after data has been processed:
    #+BEGIN_SRC sh
$ awk 'BEGIN {print "The File Contents:"}{print $0}
	END {print "File footer}' myfile
    #+END_SRC

- AWK and Shell Pipes
  - List your 10 favourite commands:
    #+BEGIN_SRC sh
$ history | awk '{print $2}' | sort | uniq -c | sort -rn | head
    #+END_SRC
  - Find out domain expiry date:
    #+BEGIN_SRC sh
$ whois neoakinito.gr | awk '/Registry Expiry Date:/ { print $4}'
    #+END_SRC


**  Some cool AWK Stuff:
- Rename within the name:
  #+BEGIN_SRC sh
$ ls -1 *old* | awk '{print "mv "$1" "$1"}' | sed s/old/new/2 | sh
  #+END_SRC
- Remove only Files: (CAUTION we remove files here!)
  #+BEGIN_SRC sh
$ ls -l * | grep -v drwx | awk '{print "rm " $9}' | sh
#     -or- with just awk:
$ ls -l | awk '$1!~/^drwx/{print $9}' | xargs rm
  #+END_SRC
- Remove only Directories: (AGAIN CAUTION Removing Shit here!)
  #+BEGIN_SRC sh
$ ls -l | grep '^d' | awk '{print "rm -r " $9}' | sh
#     -or-
$ ls -p | grep /$ | wk '{print "rm -r " $1}'
#     -or- just with awk:
$ ls -l | awk '$1~/^d.*x/{print $9}' | xargs rm -r
  #+END_SRC
- Kill Processes by name: kill process called netscape:
  #+BEGIN_SRC sh
$ kill `ps auxww | grep netspace | egrep -v grep | awk '{print $2}'`
#     -or- with just awk:
$ ps auxww | awk '$0~/netscape/&&$0!~/awk/{print $2}' | xargs kill
  #+END_SRC
