html/awk-cheatsheet.html

<div id="outline-container-orgda20296" class="outline-3">
<h3 id="orgda20296"><span class="section-number-3">1.6</span> AWK example usages:</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li><p>
Print Text File:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'{ print }'</span> /etc/passwd <span style="color: #b22222;"># </span><span style="color: #b22222;">- or -</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'{ print $0 }'</span> /etc/passwd
</pre>
</div></li>

<li><p>
Print Specified Field
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk -F <span style="color: #8b2252;">':'</span> <span style="color: #8b2252;">'{ print $1 }'</span> /etc/passwd <span style="color: #b22222;">#</span><span style="color: #b22222;">| sort</span>
</pre>
</div></li>

<li><p>
Pattern Matching:
</p>

<p>
(Display all  lines from the Apache log if HTTP error code is 500,
9th field log status error code for each https request:)
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'$9 == 500 { print $0}'</span> /var/log/httpd/access.log
</pre>
</div></li>

<li>Comparison Operators: (like C's)
<ul class="org-ul">
<li>==</li>
<li>!=</li>
<li>&lt;</li>
<li>&gt;</li>
<li>&lt;=</li>
<li>&gt;=</li>
<li>?:</li>
</ul></li>

<li><p>
Print lines containing: "tom","jerry" or "vivek":
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'/tom|jerry|vivek/'</span> /etc/passwd
</pre>
</div></li>

<li><p>
Print 1st Line from file:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">"NR==1{print;exit}"</span> /etc/resolv.conf
$ awk <span style="color: #8b2252;">"NR==$line{print;exit}"</span> /etc/resolv.conf
</pre>
</div></li>

<li><p>
Simple Arithmetic: Get the sum of numbers in a column:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'{total += $1'</span>} END {<span style="color: #483d8b;">print</span> total}<span style="color: #8b2252;">' earnings.txt</span>
</pre>
</div></li>

<li><p>
Shell can't calc floats, but awk can:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {printf "%.3f\n", 2005.50 / 3}'</span>
</pre>
</div></li>

<li><p>
Multiple AWK Commands
</p>
<div class="org-src-container">
<pre class="src src-sh">$ echo <span style="color: #8b2252;">"Hello Tom"</span> | awk <span style="color: #8b2252;">'{$2="Adam"; print $0}'</span>
</pre>
</div></li>

<li>AWK Pre-processing
<ul class="org-ul">
<li><p>
Add Title/Header:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {print "The File Contents: "}{print $0}'</span> myfile
</pre>
</div></li>
</ul></li>

<li>AWK Post-processing
<ul class="org-ul">
<li><p>
Run Script after data has been processed:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ awk <span style="color: #8b2252;">'BEGIN {print "The File Contents:"}{print $0}</span>
<span style="color: #8b2252;">        END {print "File footer}'</span> myfile
</pre>
</div></li>
</ul></li>

<li>AWK and Shell Pipes
<ul class="org-ul">
<li><p>
List your 10 favourite commands:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ history | awk <span style="color: #8b2252;">'{print $2}'</span> | sort | uniq -c | sort -rn | head
</pre>
</div></li>
<li><p>
Find out domain expiry date:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ whois neoakinito.gr | awk <span style="color: #8b2252;">'/Registry Expiry Date:/ { print $4}'</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb9ae683" class="outline-3">
<h3 id="orgb9ae683"><span class="section-number-3">1.7</span> Some cool AWK Stuff:</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li><p>
Rename within the name:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ ls -1 *old* | awk <span style="color: #8b2252;">'{print "mv "$1" "$1"}'</span> | sed s/old/new/2 | sh
</pre>
</div></li>
<li><p>
Remove only Files: (CAUTION we remove files here!)
</p>
<div class="org-src-container">
<pre class="src src-sh">$ ls -l * | grep -v drwx | awk <span style="color: #8b2252;">'{print "rm " $9}'</span> | sh
<span style="color: #b22222;">#     </span><span style="color: #b22222;">-or- with just awk:</span>
$ ls -l | awk <span style="color: #8b2252;">'$1!~/^drwx/{print $9}'</span> | xargs rm
</pre>
</div></li>
<li><p>
Remove only Directories: (AGAIN CAUTION Removing Shit here!)
</p>
<div class="org-src-container">
<pre class="src src-sh">$ ls -l | grep <span style="color: #8b2252;">'^d'</span> | awk <span style="color: #8b2252;">'{print "rm -r " $9}'</span> | sh
<span style="color: #b22222;">#     </span><span style="color: #b22222;">-or-</span>
$ ls -p | grep /$ | wk <span style="color: #8b2252;">'{print "rm -r " $1}'</span>
<span style="color: #b22222;">#     </span><span style="color: #b22222;">-or- just with awk:</span>
$ ls -l | awk <span style="color: #8b2252;">'$1~/^d.*x/{print $9}'</span> | xargs rm -r
</pre>
</div></li>
<li><p>
Kill Processes by name: kill process called netscape:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ kill <span style="color: #ff00ff;">`ps auxww | grep netspace | egrep -v grep | awk '{print $2}'`</span>
<span style="color: #b22222;">#     </span><span style="color: #b22222;">-or- with just awk:</span>
$ ps auxww | awk <span style="color: #8b2252;">'$0~/netscape/&amp;&amp;$0!~/awk/{print $2}'</span> | xargs kill
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manos Vasilakis (advizor.gr)</p>
<p class="date">Created: 2021-09-21 Tue 23:36</p>
</div>
</body>
</html>
